K6/results/staged_results_20250706160327.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_staged.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m20s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 2m50s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m01.0s/2m50.0s

running (0m02.0s), 02/50 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m02.0s/2m50.0s

running (0m03.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 03/50 VUs  0m03.0s/2m50.0s

running (0m04.0s), 04/50 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 04/50 VUs  0m04.0s/2m50.0s

running (0m05.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
default   [   3% ] 05/50 VUs  0m05.0s/2m50.0s

running (0m06.0s), 06/50 VUs, 15 complete and 0 interrupted iterations
default   [   4% ] 06/50 VUs  0m06.0s/2m50.0s

running (0m07.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
default   [   4% ] 07/50 VUs  0m07.0s/2m50.0s

running (0m08.0s), 08/50 VUs, 28 complete and 0 interrupted iterations
default   [   5% ] 08/50 VUs  0m08.0s/2m50.0s

running (0m09.0s), 09/50 VUs, 36 complete and 0 interrupted iterations
default   [   5% ] 09/50 VUs  0m09.0s/2m50.0s

running (0m10.0s), 09/50 VUs, 45 complete and 0 interrupted iterations
default   [   6% ] 09/50 VUs  0m10.0s/2m50.0s

running (0m11.0s), 10/50 VUs, 53 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  0m11.0s/2m50.0s

running (0m12.0s), 10/50 VUs, 63 complete and 0 interrupted iterations
default   [   7% ] 10/50 VUs  0m12.0s/2m50.0s

running (0m13.0s), 10/50 VUs, 72 complete and 0 interrupted iterations
default   [   8% ] 10/50 VUs  0m13.0s/2m50.0s

running (0m14.0s), 11/50 VUs, 82 complete and 0 interrupted iterations
default   [   8% ] 11/50 VUs  0m14.0s/2m50.0s

running (0m15.0s), 11/50 VUs, 92 complete and 0 interrupted iterations
default   [   9% ] 11/50 VUs  0m15.0s/2m50.0s

running (0m16.0s), 11/50 VUs, 99 complete and 0 interrupted iterations
default   [   9% ] 11/50 VUs  0m16.0s/2m50.0s

running (0m17.0s), 12/50 VUs, 110 complete and 0 interrupted iterations
default   [  10% ] 12/50 VUs  0m17.0s/2m50.0s

running (0m18.0s), 12/50 VUs, 121 complete and 0 interrupted iterations
default   [  11% ] 12/50 VUs  0m18.0s/2m50.0s

running (0m19.0s), 12/50 VUs, 133 complete and 0 interrupted iterations
default   [  11% ] 12/50 VUs  0m19.0s/2m50.0s

running (0m20.0s), 13/50 VUs, 145 complete and 0 interrupted iterations
default   [  12% ] 13/50 VUs  0m20.0s/2m50.0s

running (0m21.0s), 13/50 VUs, 158 complete and 0 interrupted iterations
default   [  12% ] 13/50 VUs  0m21.0s/2m50.0s

running (0m22.0s), 13/50 VUs, 171 complete and 0 interrupted iterations
default   [  13% ] 13/50 VUs  0m22.0s/2m50.0s

running (0m23.0s), 14/50 VUs, 184 complete and 0 interrupted iterations
default   [  14% ] 14/50 VUs  0m23.0s/2m50.0s

running (0m24.0s), 14/50 VUs, 198 complete and 0 interrupted iterations
default   [  14% ] 14/50 VUs  0m24.0s/2m50.0s

running (0m25.0s), 14/50 VUs, 211 complete and 0 interrupted iterations
default   [  15% ] 14/50 VUs  0m25.0s/2m50.0s

running (0m26.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
default   [  15% ] 15/50 VUs  0m26.0s/2m50.0s

running (0m27.0s), 15/50 VUs, 239 complete and 0 interrupted iterations
default   [  16% ] 15/50 VUs  0m27.0s/2m50.0s

running (0m28.0s), 15/50 VUs, 250 complete and 0 interrupted iterations
default   [  16% ] 15/50 VUs  0m28.0s/2m50.0s

running (0m29.0s), 16/50 VUs, 263 complete and 0 interrupted iterations
default   [  17% ] 16/50 VUs  0m29.0s/2m50.0s

running (0m30.0s), 16/50 VUs, 279 complete and 0 interrupted iterations
default   [  18% ] 16/50 VUs  0m30.0s/2m50.0s

running (0m31.0s), 16/50 VUs, 295 complete and 0 interrupted iterations
default   [  18% ] 16/50 VUs  0m31.0s/2m50.0s

running (0m32.0s), 17/50 VUs, 311 complete and 0 interrupted iterations
default   [  19% ] 17/50 VUs  0m32.0s/2m50.0s

running (0m33.0s), 17/50 VUs, 326 complete and 0 interrupted iterations
default   [  19% ] 17/50 VUs  0m33.0s/2m50.0s

running (0m34.0s), 17/50 VUs, 343 complete and 0 interrupted iterations
default   [  20% ] 17/50 VUs  0m34.0s/2m50.0s

running (0m35.0s), 18/50 VUs, 360 complete and 0 interrupted iterations
default   [  21% ] 18/50 VUs  0m35.0s/2m50.0s

running (0m36.0s), 18/50 VUs, 378 complete and 0 interrupted iterations
default   [  21% ] 18/50 VUs  0m36.0s/2m50.0s

running (0m37.0s), 18/50 VUs, 396 complete and 0 interrupted iterations
default   [  22% ] 18/50 VUs  0m37.0s/2m50.0s

running (0m38.0s), 19/50 VUs, 410 complete and 0 interrupted iterations
default   [  22% ] 19/50 VUs  0m38.0s/2m50.0s

running (0m39.0s), 19/50 VUs, 428 complete and 0 interrupted iterations
default   [  23% ] 19/50 VUs  0m39.0s/2m50.0s

running (0m40.0s), 19/50 VUs, 446 complete and 0 interrupted iterations
default   [  24% ] 19/50 VUs  0m40.0s/2m50.0s

running (0m41.0s), 20/50 VUs, 461 complete and 0 interrupted iterations
default   [  24% ] 20/50 VUs  0m41.0s/2m50.0s

running (0m42.0s), 20/50 VUs, 480 complete and 0 interrupted iterations
default   [  25% ] 20/50 VUs  0m42.0s/2m50.0s

running (0m43.0s), 20/50 VUs, 500 complete and 0 interrupted iterations
default   [  25% ] 20/50 VUs  0m43.0s/2m50.0s

running (0m44.0s), 20/50 VUs, 520 complete and 0 interrupted iterations
default   [  26% ] 20/50 VUs  0m44.0s/2m50.0s

running (0m45.0s), 21/50 VUs, 540 complete and 0 interrupted iterations
default   [  26% ] 21/50 VUs  0m45.0s/2m50.0s

running (0m46.0s), 21/50 VUs, 559 complete and 0 interrupted iterations
default   [  27% ] 21/50 VUs  0m46.0s/2m50.0s

running (0m47.0s), 21/50 VUs, 579 complete and 0 interrupted iterations
default   [  28% ] 21/50 VUs  0m47.0s/2m50.0s

running (0m48.0s), 21/50 VUs, 597 complete and 0 interrupted iterations
default   [  28% ] 21/50 VUs  0m48.0s/2m50.0s

running (0m49.0s), 22/50 VUs, 618 complete and 0 interrupted iterations
default   [  29% ] 22/50 VUs  0m49.0s/2m50.0s

running (0m50.0s), 22/50 VUs, 638 complete and 0 interrupted iterations
default   [  29% ] 22/50 VUs  0m50.0s/2m50.0s

running (0m51.0s), 22/50 VUs, 658 complete and 0 interrupted iterations
default   [  30% ] 22/50 VUs  0m51.0s/2m50.0s

running (0m52.0s), 22/50 VUs, 676 complete and 0 interrupted iterations
default   [  31% ] 22/50 VUs  0m52.0s/2m50.0s

running (0m53.0s), 23/50 VUs, 698 complete and 0 interrupted iterations
default   [  31% ] 23/50 VUs  0m53.0s/2m50.0s

running (0m54.0s), 23/50 VUs, 721 complete and 0 interrupted iterations
default   [  32% ] 23/50 VUs  0m54.0s/2m50.0s

running (0m55.0s), 23/50 VUs, 744 complete and 0 interrupted iterations
default   [  32% ] 23/50 VUs  0m55.0s/2m50.0s

running (0m56.0s), 23/50 VUs, 764 complete and 0 interrupted iterations
default   [  33% ] 23/50 VUs  0m56.0s/2m50.0s

running (0m57.0s), 24/50 VUs, 786 complete and 0 interrupted iterations
default   [  34% ] 24/50 VUs  0m57.0s/2m50.0s

running (0m58.0s), 24/50 VUs, 803 complete and 0 interrupted iterations
default   [  34% ] 24/50 VUs  0m58.0s/2m50.0s

running (0m59.0s), 24/50 VUs, 827 complete and 0 interrupted iterations
default   [  35% ] 24/50 VUs  0m59.0s/2m50.0s

running (1m00.0s), 24/50 VUs, 851 complete and 0 interrupted iterations
default   [  35% ] 24/50 VUs  1m00.0s/2m50.0s

running (1m01.0s), 25/50 VUs, 869 complete and 0 interrupted iterations
default   [  36% ] 25/50 VUs  1m01.0s/2m50.0s

running (1m02.0s), 25/50 VUs, 894 complete and 0 interrupted iterations
default   [  36% ] 25/50 VUs  1m02.0s/2m50.0s

running (1m03.0s), 25/50 VUs, 919 complete and 0 interrupted iterations
default   [  37% ] 25/50 VUs  1m03.0s/2m50.0s

running (1m04.0s), 25/50 VUs, 940 complete and 0 interrupted iterations
default   [  38% ] 25/50 VUs  1m04.0s/2m50.0s

running (1m05.0s), 26/50 VUs, 965 complete and 0 interrupted iterations
default   [  38% ] 26/50 VUs  1m05.0s/2m50.0s

running (1m06.0s), 26/50 VUs, 989 complete and 0 interrupted iterations
default   [  39% ] 26/50 VUs  1m06.0s/2m50.0s

running (1m07.0s), 26/50 VUs, 1012 complete and 0 interrupted iterations
default   [  39% ] 26/50 VUs  1m07.0s/2m50.0s

running (1m08.0s), 26/50 VUs, 1038 complete and 0 interrupted iterations
default   [  40% ] 26/50 VUs  1m08.0s/2m50.0s

running (1m09.0s), 27/50 VUs, 1062 complete and 0 interrupted iterations
default   [  41% ] 27/50 VUs  1m09.0s/2m50.0s

running (1m10.0s), 27/50 VUs, 1086 complete and 0 interrupted iterations
default   [  41% ] 27/50 VUs  1m10.0s/2m50.0s

running (1m11.0s), 27/50 VUs, 1110 complete and 0 interrupted iterations
default   [  42% ] 27/50 VUs  1m11.0s/2m50.0s

running (1m12.0s), 27/50 VUs, 1135 complete and 0 interrupted iterations
default   [  42% ] 27/50 VUs  1m12.0s/2m50.0s

running (1m13.0s), 28/50 VUs, 1160 complete and 0 interrupted iterations
default   [  43% ] 28/50 VUs  1m13.0s/2m50.0s

running (1m14.0s), 28/50 VUs, 1187 complete and 0 interrupted iterations
default   [  44% ] 28/50 VUs  1m14.0s/2m50.0s

running (1m15.0s), 28/50 VUs, 1211 complete and 0 interrupted iterations
default   [  44% ] 28/50 VUs  1m15.0s/2m50.0s

running (1m16.0s), 28/50 VUs, 1238 complete and 0 interrupted iterations
default   [  45% ] 28/50 VUs  1m16.0s/2m50.0s

running (1m17.0s), 29/50 VUs, 1261 complete and 0 interrupted iterations
default   [  45% ] 29/50 VUs  1m17.0s/2m50.0s

running (1m18.0s), 29/50 VUs, 1290 complete and 0 interrupted iterations
default   [  46% ] 29/50 VUs  1m18.0s/2m50.0s

running (1m19.0s), 29/50 VUs, 1318 complete and 0 interrupted iterations
default   [  46% ] 29/50 VUs  1m19.0s/2m50.0s

running (1m20.0s), 29/50 VUs, 1337 complete and 0 interrupted iterations
default   [  47% ] 29/50 VUs  1m20.0s/2m50.0s

running (1m21.0s), 30/50 VUs, 1364 complete and 0 interrupted iterations
default   [  48% ] 30/50 VUs  1m21.0s/2m50.0s

running (1m22.0s), 30/50 VUs, 1391 complete and 0 interrupted iterations
default   [  48% ] 30/50 VUs  1m22.0s/2m50.0s

running (1m23.0s), 30/50 VUs, 1418 complete and 0 interrupted iterations
default   [  49% ] 30/50 VUs  1m23.0s/2m50.0s

running (1m24.0s), 30/50 VUs, 1448 complete and 0 interrupted iterations
default   [  49% ] 30/50 VUs  1m24.0s/2m50.0s

running (1m25.0s), 31/50 VUs, 1474 complete and 0 interrupted iterations
default   [  50% ] 31/50 VUs  1m25.0s/2m50.0s

running (1m26.0s), 31/50 VUs, 1502 complete and 0 interrupted iterations
default   [  51% ] 31/50 VUs  1m26.0s/2m50.0s

running (1m27.0s), 31/50 VUs, 1529 complete and 0 interrupted iterations
default   [  51% ] 31/50 VUs  1m27.0s/2m50.0s

running (1m28.0s), 31/50 VUs, 1556 complete and 0 interrupted iterations
default   [  52% ] 31/50 VUs  1m28.0s/2m50.0s

running (1m29.0s), 32/50 VUs, 1587 complete and 0 interrupted iterations
default   [  52% ] 32/50 VUs  1m29.0s/2m50.0s

running (1m30.0s), 32/50 VUs, 1619 complete and 0 interrupted iterations
default   [  53% ] 32/50 VUs  1m30.0s/2m50.0s

running (1m31.0s), 32/50 VUs, 1645 complete and 0 interrupted iterations
default   [  54% ] 32/50 VUs  1m31.0s/2m50.0s

running (1m32.0s), 32/50 VUs, 1665 complete and 0 interrupted iterations
default   [  54% ] 32/50 VUs  1m32.0s/2m50.0s

running (1m33.0s), 33/50 VUs, 1697 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  1m33.0s/2m50.0s

running (1m34.0s), 33/50 VUs, 1729 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  1m34.0s/2m50.0s

running (1m35.0s), 33/50 VUs, 1748 complete and 0 interrupted iterations
default   [  56% ] 33/50 VUs  1m35.0s/2m50.0s

running (1m36.0s), 33/50 VUs, 1775 complete and 0 interrupted iterations
default   [  56% ] 33/50 VUs  1m36.0s/2m50.0s

running (1m37.0s), 34/50 VUs, 1808 complete and 0 interrupted iterations
default   [  57% ] 34/50 VUs  1m37.0s/2m50.0s

running (1m38.0s), 34/50 VUs, 1827 complete and 0 interrupted iterations
default   [  58% ] 34/50 VUs  1m38.0s/2m50.0s

running (1m39.0s), 34/50 VUs, 1857 complete and 0 interrupted iterations
default   [  58% ] 34/50 VUs  1m39.0s/2m50.0s

running (1m40.0s), 34/50 VUs, 1891 complete and 0 interrupted iterations
default   [  59% ] 34/50 VUs  1m40.0s/2m50.0s

running (1m41.0s), 35/50 VUs, 1907 complete and 0 interrupted iterations
default   [  59% ] 35/50 VUs  1m41.0s/2m50.0s

running (1m42.0s), 35/50 VUs, 1938 complete and 0 interrupted iterations
default   [  60% ] 35/50 VUs  1m42.0s/2m50.0s

running (1m43.0s), 35/50 VUs, 1973 complete and 0 interrupted iterations
default   [  61% ] 35/50 VUs  1m43.0s/2m50.0s

running (1m44.0s), 35/50 VUs, 1987 complete and 0 interrupted iterations
default   [  61% ] 35/50 VUs  1m44.0s/2m50.0s

running (1m45.0s), 36/50 VUs, 2021 complete and 0 interrupted iterations
default   [  62% ] 36/50 VUs  1m45.0s/2m50.0s

running (1m46.0s), 36/50 VUs, 2056 complete and 0 interrupted iterations
default   [  62% ] 36/50 VUs  1m46.0s/2m50.0s

running (1m47.0s), 36/50 VUs, 2071 complete and 0 interrupted iterations
default   [  63% ] 36/50 VUs  1m47.0s/2m50.0s

running (1m48.0s), 36/50 VUs, 2107 complete and 0 interrupted iterations
default   [  64% ] 36/50 VUs  1m48.0s/2m50.0s

running (1m49.0s), 37/50 VUs, 2143 complete and 0 interrupted iterations
default   [  64% ] 37/50 VUs  1m49.0s/2m50.0s

running (1m50.0s), 37/50 VUs, 2165 complete and 0 interrupted iterations
default   [  65% ] 37/50 VUs  1m50.0s/2m50.0s

running (1m51.0s), 37/50 VUs, 2199 complete and 0 interrupted iterations
default   [  65% ] 37/50 VUs  1m51.0s/2m50.0s

running (1m52.0s), 37/50 VUs, 2233 complete and 0 interrupted iterations
default   [  66% ] 37/50 VUs  1m52.0s/2m50.0s

running (1m53.0s), 38/50 VUs, 2264 complete and 0 interrupted iterations
default   [  66% ] 38/50 VUs  1m53.0s/2m50.0s

running (1m54.0s), 38/50 VUs, 2298 complete and 0 interrupted iterations
default   [  67% ] 38/50 VUs  1m54.0s/2m50.0s

running (1m55.0s), 38/50 VUs, 2327 complete and 0 interrupted iterations
default   [  68% ] 38/50 VUs  1m55.0s/2m50.0s

running (1m56.0s), 38/50 VUs, 2364 complete and 0 interrupted iterations
default   [  68% ] 38/50 VUs  1m56.0s/2m50.0s

running (1m57.0s), 39/50 VUs, 2397 complete and 0 interrupted iterations
default   [  69% ] 39/50 VUs  1m57.0s/2m50.0s

running (1m58.0s), 39/50 VUs, 2429 complete and 0 interrupted iterations
default   [  69% ] 39/50 VUs  1m58.0s/2m50.0s

running (1m59.0s), 39/50 VUs, 2457 complete and 0 interrupted iterations
default   [  70% ] 39/50 VUs  1m59.0s/2m50.0s

running (2m00.0s), 39/50 VUs, 2496 complete and 0 interrupted iterations
default   [  71% ] 39/50 VUs  2m00.0s/2m50.0s

running (2m01.0s), 40/50 VUs, 2528 complete and 0 interrupted iterations
default   [  71% ] 40/50 VUs  2m01.0s/2m50.0s

running (2m02.0s), 40/50 VUs, 2552 complete and 0 interrupted iterations
default   [  72% ] 40/50 VUs  2m02.0s/2m50.0s

running (2m03.0s), 40/50 VUs, 2591 complete and 0 interrupted iterations
default   [  72% ] 40/50 VUs  2m03.0s/2m50.0s

running (2m04.0s), 40/50 VUs, 2618 complete and 0 interrupted iterations
default   [  73% ] 40/50 VUs  2m04.0s/2m50.0s

running (2m05.0s), 41/50 VUs, 2654 complete and 0 interrupted iterations
default   [  74% ] 41/50 VUs  2m05.0s/2m50.0s

running (2m06.0s), 41/50 VUs, 2694 complete and 0 interrupted iterations
default   [  74% ] 41/50 VUs  2m06.0s/2m50.0s

running (2m07.0s), 41/50 VUs, 2717 complete and 0 interrupted iterations
default   [  75% ] 41/50 VUs  2m07.0s/2m50.0s

running (2m08.0s), 41/50 VUs, 2756 complete and 0 interrupted iterations
default   [  75% ] 41/50 VUs  2m08.0s/2m50.0s

running (2m09.0s), 42/50 VUs, 2786 complete and 0 interrupted iterations
default   [  76% ] 42/50 VUs  2m09.0s/2m50.0s

running (2m10.0s), 42/50 VUs, 2823 complete and 0 interrupted iterations
default   [  76% ] 42/50 VUs  2m10.0s/2m50.0s

running (2m11.0s), 42/50 VUs, 2854 complete and 0 interrupted iterations
default   [  77% ] 42/50 VUs  2m11.0s/2m50.0s

running (2m12.0s), 42/50 VUs, 2896 complete and 0 interrupted iterations
default   [  78% ] 42/50 VUs  2m12.0s/2m50.0s

running (2m13.0s), 43/50 VUs, 2925 complete and 0 interrupted iterations
default   [  78% ] 43/50 VUs  2m13.0s/2m50.0s

running (2m14.0s), 43/50 VUs, 2961 complete and 0 interrupted iterations
default   [  79% ] 43/50 VUs  2m14.0s/2m50.0s

running (2m15.0s), 43/50 VUs, 2993 complete and 0 interrupted iterations
default   [  79% ] 43/50 VUs  2m15.0s/2m50.0s

running (2m16.0s), 43/50 VUs, 3030 complete and 0 interrupted iterations
default   [  80% ] 43/50 VUs  2m16.0s/2m50.0s

running (2m17.0s), 44/50 VUs, 3057 complete and 0 interrupted iterations
default   [  81% ] 44/50 VUs  2m17.0s/2m50.0s

running (2m18.0s), 44/50 VUs, 3057 complete and 0 interrupted iterations
default   [  81% ] 44/50 VUs  2m18.0s/2m50.0s

running (2m19.0s), 44/50 VUs, 3057 complete and 0 interrupted iterations
default   [  82% ] 44/50 VUs  2m19.0s/2m50.0s

running (2m20.0s), 44/50 VUs, 3057 complete and 0 interrupted iterations
default   [  82% ] 44/50 VUs  2m20.0s/2m50.0s

running (2m21.0s), 45/50 VUs, 3057 complete and 0 interrupted iterations
default   [  83% ] 45/50 VUs  2m21.0s/2m50.0s

running (2m22.0s), 45/50 VUs, 3057 complete and 0 interrupted iterations
default   [  84% ] 45/50 VUs  2m22.0s/2m50.0s

running (2m23.0s), 45/50 VUs, 3057 complete and 0 interrupted iterations
default   [  84% ] 45/50 VUs  2m23.0s/2m50.0s

running (2m24.0s), 45/50 VUs, 3057 complete and 0 interrupted iterations
default   [  85% ] 45/50 VUs  2m24.0s/2m50.0s

running (2m25.0s), 46/50 VUs, 3057 complete and 0 interrupted iterations
default   [  85% ] 46/50 VUs  2m25.0s/2m50.0s

running (2m26.0s), 46/50 VUs, 3057 complete and 0 interrupted iterations
default   [  86% ] 46/50 VUs  2m26.0s/2m50.0s

running (2m27.0s), 46/50 VUs, 3057 complete and 0 interrupted iterations
default   [  86% ] 46/50 VUs  2m27.0s/2m50.0s

running (2m28.0s), 46/50 VUs, 3057 complete and 0 interrupted iterations
default   [  87% ] 46/50 VUs  2m28.0s/2m50.0s

running (2m29.0s), 47/50 VUs, 3057 complete and 0 interrupted iterations
default   [  88% ] 47/50 VUs  2m29.0s/2m50.0s

running (2m30.0s), 47/50 VUs, 3057 complete and 0 interrupted iterations
default   [  88% ] 47/50 VUs  2m30.0s/2m50.0s

running (2m31.0s), 47/50 VUs, 3057 complete and 0 interrupted iterations
default   [  89% ] 47/50 VUs  2m31.0s/2m50.0s

running (2m32.0s), 47/50 VUs, 3057 complete and 0 interrupted iterations
default   [  89% ] 47/50 VUs  2m32.0s/2m50.0s

running (2m33.0s), 48/50 VUs, 3059 complete and 0 interrupted iterations
default   [  90% ] 48/50 VUs  2m33.0s/2m50.0s

running (2m34.0s), 48/50 VUs, 3066 complete and 0 interrupted iterations
default   [  91% ] 48/50 VUs  2m34.0s/2m50.0s

running (2m35.0s), 48/50 VUs, 3095 complete and 0 interrupted iterations
default   [  91% ] 48/50 VUs  2m35.0s/2m50.0s

running (2m36.0s), 48/50 VUs, 3129 complete and 0 interrupted iterations
default   [  92% ] 48/50 VUs  2m36.0s/2m50.0s

running (2m37.0s), 49/50 VUs, 3152 complete and 0 interrupted iterations
default   [  92% ] 49/50 VUs  2m37.0s/2m50.0s

running (2m38.0s), 49/50 VUs, 3194 complete and 0 interrupted iterations
default   [  93% ] 49/50 VUs  2m38.0s/2m50.0s

running (2m39.0s), 49/50 VUs, 3226 complete and 0 interrupted iterations
default   [  94% ] 49/50 VUs  2m39.0s/2m50.0s

running (2m40.0s), 49/50 VUs, 3265 complete and 0 interrupted iterations
default   [  94% ] 49/50 VUs  2m40.0s/2m50.0s

running (2m41.0s), 50/50 VUs, 3279 complete and 0 interrupted iterations
default   [  95% ] 50/50 VUs  2m41.0s/2m50.0s

running (2m42.0s), 44/50 VUs, 3329 complete and 0 interrupted iterations
default   [  95% ] 44/50 VUs  2m42.0s/2m50.0s

running (2m43.0s), 40/50 VUs, 3348 complete and 0 interrupted iterations
default   [  96% ] 40/50 VUs  2m43.0s/2m50.0s

running (2m44.0s), 36/50 VUs, 3381 complete and 0 interrupted iterations
default   [  96% ] 36/50 VUs  2m44.0s/2m50.0s

running (2m45.0s), 29/50 VUs, 3416 complete and 0 interrupted iterations
default   [  97% ] 29/50 VUs  2m45.0s/2m50.0s

running (2m46.0s), 22/50 VUs, 3445 complete and 0 interrupted iterations
default   [  98% ] 22/50 VUs  2m46.0s/2m50.0s

running (2m47.0s), 17/50 VUs, 3463 complete and 0 interrupted iterations
default   [  98% ] 17/50 VUs  2m47.0s/2m50.0s

running (2m48.0s), 14/50 VUs, 3479 complete and 0 interrupted iterations
default   [  99% ] 14/50 VUs  2m48.0s/2m50.0s

running (2m49.0s), 08/50 VUs, 3492 complete and 0 interrupted iterations
default   [  99% ] 08/50 VUs  2m49.0s/2m50.0s

running (2m50.0s), 05/50 VUs, 3499 complete and 0 interrupted iterations
default   [ 100% ] 05/50 VUs  2m50.0s/2m50.0s


  █ TOTAL RESULTS 

    checks_total.......................: 10512   61.558911/s
    checks_succeeded...................: 100.00% 10512 out of 10512
    checks_failed......................: 0.00%   0 out of 10512

    ✓ orders list: status 200
    ✓ order detail: status 200
    ✓ user info: status 200

    HTTP
    http_req_duration.......................................................: avg=132.79ms min=7.51ms med=33.01ms max=17.42s p(90)=141.61ms p(95)=193.36ms
      { expected_response:true }............................................: avg=132.79ms min=7.51ms med=33.01ms max=17.42s p(90)=141.61ms p(95)=193.36ms
    http_req_failed.........................................................: 0.00%  0 out of 10512
    http_reqs...............................................................: 10512  61.558911/s

    EXECUTION
    iteration_duration......................................................: avg=1.4s     min=1.03s  med=1.1s    max=19.11s p(90)=1.41s    p(95)=1.55s   
    iterations..............................................................: 3504   20.519637/s
    vus.....................................................................: 5      min=1          max=50
    vus_max.................................................................: 50     min=50         max=50

    NETWORK
    data_received...........................................................: 645 MB 3.8 MB/s
    data_sent...............................................................: 4.3 MB 25 kB/s



running (2m50.8s), 00/50 VUs, 3504 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  2m50s